/* Screencast Quota Warning Title */
"Approaching Video Limit" = "Die Höchstzahl für Videos wird bald erreicht";

/* Screencast Call to Action: Contact Us */
"Contact Us" = "Kontaktinformationen";

/* Screencast Call to Action: Manage Library */
"Manage Library" = "Bibliothek verwalten";

/* OK */
"OK" = "OK";

/* Unable to share Screencast2022 error - message */
"Please check your network connection and try again." = "Bitte prüfen Sie Ihre Internetverbindung und wiederholen Sie den Vorgang.";

/* plugin name */
"Screencast" = "Screencast";

/* Sign in button Screencast2022 */
"Sign In..." = "Anmelden...";

/* Sign out button Screencast2022 */
"Sign Out" = "Abmelden";

/* Link has been copied Screencast2022 message */
"The link to your capture is ready to be pasted" = "Der Link zu Ihrem Capture kann eingefügt werden";

/* Screencast Quota Reached Title */
"Unable to Share to Screencast" = "Weitergabe an Screencast nicht möglich";

/* Trial expired Screencast2022 error - title
   Unable to share Screencast2022 error - title */
"Unable to share to Screencast" = "Weitergabe an Screencast nicht möglich";

/* Screencast Call to Action: Upgrade */
"Upgrade" = "Upgrade";

/* plugin description */
"Upload the capture to Screencast for image or video hosting." = "Lädt das Capture auf Screencast als Hosting-Plattform für Bilder oder Videos hoch.";

/* plugin description */
"Upload the capture to the cloud for image or video hosting." = "Lädt das Capture in die Cloud zum Hosten von Bildern oder Videos hoch.";

/* Screencast Quota Warning Message for Free Accounts */
"You are close to the 25 video limit on your free Screencast account. Upgrade to unlock 250 videos or manage your Screencast Library to keep sharing without interruption." = "Sie werden bald die Höchstzahl von 25 Videos für Ihr kostenloses Screencast-Konto erreichen. Machen Sie jetzt das Upgrade, um Platz für 250 Videos freizuschalten oder verwalten Sie Ihre Screencast-Bibliothek, um ohne Unterbrechung weiter Videos teilen zu können.";

/* Screencast Quota Warning Message for Pro Accounts */
"You are close to your limit of 250 videos. Review and manage your Screencast Library to keep sharing, or contact us for more account options." = "Sie werden bald die Höchstzahl von 250 Videos erreichen. Prüfen und verwalten Sie Ihre Screencast-Bibliothek, um weiter Videos teilen zu können oder erkundigen Sie sich bei uns nach weiteren Kontoangeboten.";

/* Screencast Quota Reached Message for Free Accounts */
"You've reached the limit of 25 videos on your free Screencast account. Upgrade now to allow 250 videos or manage your Screencast Library to keep the conversations going." = "Sie haben die Höchstzahl von 25 Videos für Ihr kostenloses Screencast-Konto erreicht. Machen Sie jetzt das Upgrade auf 250 Videos oder verwalten Sie Ihre Screencast-Bibliothek, um das Gespräch in Gang zu halten.";

/* Screencast Quota Reached Message for Pro Accounts */
"You've reached your limit of 250 videos. Review and manage your Screencast Library to keep sharing, or contact us for more account options." = "Sie haben die Höchstzahl von 250 Videos erreicht. Prüfen und verwalten Sie Ihre Screencast-Bibliothek, um weiter Videos teilen zu können oder erkundigen Sie sich bei uns nach weiteren Kontoangeboten.";

/* Trial expired Screencast2022 error - message */
"Your trial or account access has ended. Please update your account to share." = "Ihre Testzeit oder Ihr Zugriff auf das Konto ist abgelaufen. Bitte aktualisieren Sie Ihr Konto, um Inhalte weiterzugeben.";

